In [1]:
import pandas as pd

## Series 예시
data = [10, 20, 30, 40]
series = pd.Series(data, index=['a', 'b', 'c', 'd'])
series

a    10
b    20
c    30
d    40
dtype: int64

In [2]:
## DataFrame 예시
data = {
    '이름': ['홍길동', '김철수', '이영희'],
    '나이': [25, 30, 22]
}
df = pd.DataFrame(data)
df

    이름  나이
0  홍길동  25
1  김철수  30
2  이영희  22

In [3]:
## read_csv 예시
df_csv = pd.read_csv('auto_mpg_dataset.csv') # CSV 파일 경로 지정 
df_csv

,MPG,Cylinders,Displacement,Horsepower,Weight,Acceleration,Model Year,Origin
0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,8,350.0,165,3693,11.5,70,1,buick skylark 320
2,8,318.0,150,3436,11.0,70,1,plymouth satellite
3,8,304.0,150,3433,12.0,70,1,amc rebel sst
4,8,302.0,140,3449,10.5,70,1,ford torino
...,...,...,...,...,...,...,...,...
393,4,140.0,86,2790,15.6,82,1,ford mustang gl
394,4,97.0,52,2130,24.6,82,2,vw pickup
395,4,135.0,84,2295,11.6,82,1,dodge rampage
396,4,120.0,79,2625,18.6,82,1,ford ranger
397,4,119.0,82,2720,19.4,82,1,chevy s-10

In [4]:
## read_excel 예시
df_excel = pd.read_excel('auto_mpg_dataset.xlsx') # xlsx 파일 경로 지정 
df_excel

,MPG,Cylinders,Displacement,Horsepower,Weight,Acceleration,Model Year,Origin
0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,8,350.0,165,3693,11.5,70,1,buick skylark 320
2,8,318.0,150,3436,11.0,70,1,plymouth satellite
3,8,304.0,150,3433,12.0,70,1,amc rebel sst
4,8,302.0,140,3449,10.5,70,1,ford torino
...,...,...,...,...,...,...,...,...
393,4,140.0,86,2790,15.6,82,1,ford mustang gl
394,4,97.0,52,2130,24.6,82,2,vw pickup
395,4,135.0,84,2295,11.6,82,1,dodge rampage
396,4,120.0,79,2625,18.6,82,1,ford ranger
397,4,119.0,82,2720,19.4,82,1,chevy s-10

In [6]:
## Dictionary 데이터
data = {
    '제품': ['사과', '바나나', '체리'],
    '가격': [1000, 1500, 2000],
    '수량': [30, 45, 20]
}

## Dictionary를 DataFrame으로 변환
df = pd.DataFrame(data)
print("Dictionary를 DataFrame으로 변환:")
print(df)
print()

## 활용 예시: 총 판매 금액 계산
df['총금액'] = df['가격'] * df['수량']
df

Dictionary를 DataFrame으로 변환:
    제품    가격  수량
0   사과  1000  30
1  바나나  1500  45
2   체리  2000  20

    제품    가격  수량    총금액
0   사과  1000  30  30000
1  바나나  1500  45  67500
2   체리  2000  20  40000